# coding=utf8
import string

#set prices for the operations
priceForInsertion =1
priceForDeletion =1
priceForSubstitution =1

def cleanString(text):
    #remove all punctuation, whitespaces, make it all lowercase
    return text.translate(str.maketrans('','',string.punctuation + string.whitespace)).lower()

def levenshtein_distance(string1, string2):
    #trim the input
    string1 = cleanString(string1)
    string2 = cleanString(string2)

    #get the length of the strings for code clarity later
    str1Length = len(string1)
    str2Length = len(string2)

    #create the matrix and fill it with 0
    #adding one to the length for the insertion of the "zero" character at the beginning of the string
    matrix = [[0 for x in range(str1Length + 1)] for y in range(str2Length + 1)]

    #filling up the first row
    for i in range(1, str1Length + 1):
        matrix[0][i] = i

    #filling up the first col
    for i in range(1, str2Length + 1):
        matrix[i][0] = i

    for j in range(1, str1Length + 1):
        for i in range(1, str2Length + 1):
            #calculate current price for substitution
            if string1[j - 1] == string2[i - 1]:
                currentPriceForSubstitution = 0
            else:
                currentPriceForSubstitution = priceForSubstitution

            # get the min of
            #left diagonal + priceForSubstitution
            #up + priceForDeletion
            #left + priceForInsertion

            matrix[i][j] = min(matrix[i - 1][j] + priceForDeletion,
                          matrix[i][j - 1] + priceForInsertion,
                          matrix[i - 1][j - 1] + currentPriceForSubstitution)

#the levenstein distance is the down right corner
    return matrix[str2Length][str1Length]


def main():
    s1 = """
   Затова не искаме Борисов бе, тъпунгер. ЗА ДА НЯМА ГЛАД И МИЗЕРИЯ КАТО ДОЙДЕ НЕГОВОТО КРАДЛИВО УПРАВЛЕНИЕ!!
Затова гласувайте за ГЕРБ да надхвърли 121 депутата и всичко ще е ОК.Ще има стабилно правителство , асна отговорност и просперитет.Така че висока избирателна активност, не да ходите за гъби.
Вчера: &quot;Бойко Борисов заяви, че Реформаторите ще са последните, с които ще говори след изборите заради нападките спрямо ГЕРБ.&quot; Днес: &quot;Борисов: Ако не сме с Реформаторите, скоро пак ще има избори&quot;.
Е, аз затова няма да гласувам за Реформаторския блок (ако и да има хляб в някои от тях), защото знам, че ще се коалират с Боко (каквито и да ги плещи той). Сори!
Боки да не спира да си играе ролята на десен евро-атлантик, че тия 120 депутати, които му се присънват така ще се стопят, като едното нищо!
Тикво! Дори да спечелиш изборите, цяла България ще излезе на улиците! Този път няма да ти се размине само с камъни!
Реформаторите са единствените с шанс за НС, които махнаха агентите на ДС от списъците си с кандидат-депутати. Коментара е излишен!
БСП е умряла котка, която никога няма да бъде фактор в политически живот на България, разберете го.Народът си извади поуките вече.
без да съм песимист мога да кажа, че още тези избори идват твърде късно за българия и са достатъчно фатални. разбира се, че има среди, които смятат, че като се снишат бурята ще ги отмине, но аз този път се съмнявам, понеже стартовите показатели и основи, които бяха поставени от правителството на орешарски (къде зачезна този смел мъж?) за едно следващо правителство със слаба подкрепа са поставени на нездрава основа, върху която това правителство плува. накр: няма никаква здрава основа, а течението което иде е силно. на мене лично ми се ще българия да бъде спасена, но не виждам как да стане това без реални участници в този процес.
Няма по-голям дразнител в държавата от този тулуп. Да го пратим обратно в пожарната на 05-и, макар че неговата сила е не в гасенето, а в паленето и поддържането на пожари.
ПОЗИЦИЯТА НА БОРИСОВ МОЖЕ ДА БЪДЕ ФЛЕКСАБИЛНА И ТОВА МУ ДАВА САМО ПРЕИМУЩЕСТВО НО КРАТУНИТЕ НЕ ГО МОГАТ И ВИЯТ ДО НЕБЕСАТА ОТ ЗАВИСТ И ЗЛОБА !
Боце, давай към нови избори! Защото се очаква силен прилив на интелект и ум в гербаджийските редици. Преди секунди тризначките обявиха намерението си да се кандидатират за депутати от редиците на ГЕРБ.
ГЕРБ взема 55% и България има ясен път напред.Това е братя българи.Гласувайте масово и активно.
и за какво ти е едно калпаво правителство да е стабилно? по-добре да не е стабилно
Не е толкова просто решение. Предишният път, като имаха всичката власт, кого осъдиха? Как назначаваха министри и незавършили нищо специалисти? Как не плащаха на фирмите?
Бойко бил тиква, Бойко бил мухобойко, Бойко бил бандит, Бойко бил мутра! Да, ама&quot;Мутрата&quot; води най-голямата партия в България, която сам си я създаде! Може да е тиква, може да е бандит, но е абсолютно прав, няма ли мнозинство в Парламента, нищо няма да зависи от него и ще има избори до дупка! И РБ и Бардаков са гола вода, въздух под налягане! Плямпане, плямпане, плямпане! Плюят Бойко, че прерязал 1000 лентички! Да не си ги е рязал за кеф в къщи! Първо строиш, после режеш! 1000 обекта - 1000 лентички, кой е построил повече от него! Уж критикуват, а всъшност го хвалят! 1000 лентички за 3 години, а &quot;великия&quot; Путин за 14 години нито една!
Положението ни е критично. Тези Реформатори, толкова себични ли са! Никак не обичам коалиции, а реформаторите са точно това. Къде с тях, бе народе? Гласувайте за по-малкото зло- ГЕАРБ. Пък и не са зло, стараят се за България. Имат и сериозни попадения, напр. Европейския финансов министър, Кмета на София, Министери от предишното им управление...все сериозни и всеотдайни хора!.
Бойко може и сам да спечели защото, християните са с него, Бог е с него, българите са с него ! Запомнете го !
Реформаторите наистина работят за нови избори след шест месеца. Така ги устройва.
Боце- мамин ненагледен! Както си я подкарал май пак ще разнасяш и връщаш на пуделчето Офшорко папките с нереализиран мандат! Ми сега като го няма Станишев, кой ще е виновен? И кварталните помияри бягат от тебе ненагледен на мама!
утре се очаква Борисов да се изходи. ДИР-а да не пропусне да отрази подобаващо новината!
Мразя фанатиците! Особенно червените, но и десните не понасям! Бойко е всичко друго но не фанатик. Както каза Кеворк ръката му е винаги на задната скорост. Който не умее да остъпва не е политик. Фанатиците са добри само на фронта!
тази мутра Борисов няма ли да се махне нанякъде и да остави на мира държавата и обществото. бахтън от неговите тъпотий. Не може ли да си намери други слушатели за неговите глупости?
А ГЕРБ отиват за гъби в гората. А там един Южен поток и Баба Меца го пази. ГЕРБ хорово - Ние сме за ЮП, ние сме за Юп, ние сме за ЮП. А Борисов внасЯ ли внасЯ.В петък.
Гази ги наред комундетата Бойко,а ката си пак на волана знаеш вече как да ги лекуваш!!Успех!!
    """
    s='"Мутрата" води най-голямата партия в България! Може да е тиква, може да е бандит, но е абсолютно прав, няма ли мнозинство в Парламента, нищо няма да зависи от него и ще има избори до дупка! И РБ и Бардаков са гола вода, въздух под налягане! Плямпане, плямпане, плямпане! Плюят Бойко, че прерязал 1000 лентички! Да не си ги е рязал за кеф в къщи! Първо строиш, после режеш! 1000 обекта - 1000 лентички, кой е построил повече от него! Уж критикуват, а всъшност го хвалят! 1000 лентички за 3 години, а "великия" Путин за 14 години нито една!'

    print("Levenstein distance between these comments: ")
    print(levenshtein_distance(s1, s))


if __name__ == "__main__":
    main()